#### Creating a retail banking database and adding tables to it

In [2]:
# loading the libraries to be used 
import pandas as pd 
import psycopg2 as ps 
import numpy as np

C:\Users\USER\AppData\Local\Temp\ipykernel_14532\3749298225.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [8]:
def create_database () :
    """A function to create and connect a database """
    # connecting to a default database 
    conn = ps.connect("host = 127.0.0.1 dbname=postgres user=postgres  password=Breakingbad ")
    conn.set_session(autocommit=True)
    cur = conn.cursor()


    # create a database 
    cur.execute("DROP DATABASE IF EXISTS banking")
    cur.execute ("CREATE DATABASE banking")

    # closing the connection to the default datbase 
    cur.close()

    # connecting the created database
    conn = ps.connect("host = 127.0.0.1 dbname=postgres user=postgres  password=Breakingbad ")
    conn.set_session(autocommit=True)
    cur = conn.cursor()

In [ ]:
loans_table = ("""
    CREATE TABLE IF NOT EXISTS loans(
            loan_id VARCHAR PRIMARY KEY NOT NULL,
            account_id VARCHAR NOT NULL,
            amount NUMERIC 
            duration INTEGER 
            year INTEGER
            purpose TEXT 
    )""")

#execute the query 
cur.execute(loans_table)
#commiting the query 
cur.commit()

In [10]:
accounts = pd.read_csv("accounts.csv")
accounts.head()

   client_id   first      last                       email    fulldate
0  C00000001    Emma     Smith        emma.smith@gmail.com  1990-12-13
1  C00000002    Noah  Thompson     noah.thompson@gmail.com  1965-02-04
2  C00000003  Olivia   Johnson  olivia.johnson@outlook.com  1960-10-09
3  C00000004    Liam     White        liam.white@gmail.com  1976-12-01
4  C00000005  Sophia  Williams   sophia.williams@gmail.com  1980-07-03

In [ ]:
clients_table =("""
    CREATE TABLE IF NOT EXISTS clients (
        client_id VARCHAR PRIMARY KEY NOT NULL
        first_name TEXT
        last_name TEXT
        email VARCHAR 
        date_of_birth DATE 
                 )""")

#execute the query 
cur.execute(clients_table_table)
#commiting the query 
cur.commit()

In [3]:
accounts = pd.read_csv("accounts.csv")
accounts.head()

  account_id  district_id         frequency  parseddate
0  A00000576           55  Monthly Issuance  2013-01-01
1  A00003818           74  Monthly Issuance  2013-01-01
2  A00000704           55  Monthly Issuance  2013-01-01
3  A00002378           16  Monthly Issuance  2013-01-01
4  A00002632           24  Monthly Issuance  2013-01-02

In [ ]:
accounts_table = ("""
    CREATE TABLE IF NOT EXISTS accounts (
            account_id VARCHAR PRIMARY KEY NOT NULL
            district_id INTEGER
            frequency TEXT
            parsedate DATE
    )""")